In [1]:
import numpy as np
import pandas as pd
import random
import math
import statistics as stat
import matplotlib.pyplot as plt
import itertools
import warnings
from simul_file import mmn_queueing_jsq, queue_length_time_graph, \
                        mmn_queueing_redundancy_dos, mmn_queueing_redundancy_doc, \
                        mmn_queueing_redundancy_dos_identical, \
                        mmn_queueing_redundancy_doc_identical, \
                        mmn_queueing_redundancy_dos_weibull, \
                        mmn_queueing_redundancy_doc_weibull,\
                        mmn_queueing_jsq_weibull

In [ ]:
mmn_queueing_jsq(n,arrival_rate,service_rate,simulation_time=60,simuseed=math.nan,policy="jsq1")
queue_length_time_graph(event_calendar,other_stat,gtype="queue",sq_no=math.nan)
mmn_queueing_redundancy_dos(n,d,arrival_rate,service_rate,simulation_time=60,simuseed=math.nan)
mmn_queueing_redundancy_doc(n,d,arrival_rate,service_rate,simulation_time=60,simuseed=math.nan)
mmn_queueing_redundancy_dos_identical(n,d,arrival_rate,service_rate,simulation_time=60,simuseed=math.nan)
mmn_queueing_redundancy_doc_identical(n,d,arrival_rate,service_rate,simulation_time=60,simuseed=math.nan)
mmn_queueing_redundancy_dos_weibull(n,d,arrival_rate,scale,shape,simulation_time=60,simuseed=math.nan)
mmn_queueing_redundancy_doc_weibull(n,d,arrival_rate,scale,shape,simulation_time=60,simuseed=math.nan)
mmn_queueing_jsq_weibull(n,arrival_rate,scale,shape,simulation_time=60,simuseed=math.nan)

In [4]:
aaa = mmn_queueing_jsq(6,50,[13,5,9,22,15,7],simulation_time=1000,simuseed=8,policy="jsq1")
bbb = mmn_queueing_redundancy_dos(6,5,50,[13,5,9,22,15,7],simulation_time=1000,simuseed=8)
ccc = mmn_queueing_redundancy_doc(6,5,50,[13,5,9,22,15,7],simulation_time=1000,simuseed=8)

In [ ]:
def system_compare(system_result1,system_result2):

In [5]:
aaa[6]

,Server1,Server2,Server3,Server4,Server5,Server6,Grand total
Arrived customers,9223.0,4452.0,7007.0,13434.0,10257.0,5786.0,50159.0
Completed services,9222.0,4452.0,7006.0,13433.0,10257.0,5785.0,50155.0

In [6]:
bbb[6]

,Server1,Server2,Server3,Server4,Server5,Server6,Grand total
Arrived customers,9291,4180,6975,13872,10379,5629,50326
Completed services,9291,4179,6974,13871,10378,5628,50321

In [7]:
ccc[6]

,Server1,Server2,Server3,Server4,Server5,Server6,Grand total
Arrived customers,9154,3575,6309,15411,10616,5012,50077
Completed services,9153,3574,6308,15410,10615,5012,50072

In [ ]:
aaa[6].iloc[]

In [12]:
aaa[4]

,Server1 Average waiting time,Server2 Average waiting time,Server3 Average waiting time,Server4 Average waiting time,Server5 Average waiting time,Server6 Average waiting time,Grand Average waiting time
0,0.028,0.098,0.046,0.014,0.023,0.062,0.036